/**
 *@file AB_UTILITY_ADDR_RESOURCE.c
 *@author bfzhang
 *@brief the addr resource for addr parsing
 * create the file in 2007-07-02
 */ 

#include <stdint.h>
#include "AB_UTILITY_ADDR_RESOURCE.h"

/**
 *@desc: address feature word
 */
/*
 * @due to "中路" is in our basic dict, 
 * "香港中路" will get wrong province "香港", 
 * since its parse result is 香港-中路,
 * which is unexpected in current procedure.
 */
const uint32_t ADDR_FEAT_WORD_COUNT = 23;
const char * ADDR_FEAT_WORD[] = {
    "乡",    "镇",    
    "村庄",  "村",    "庄",    "路",    "大街",    "中路", //add 中路
    "街",    "街道",  "大道",  "道",    "口",    
    "门",    "里",    "区",    "桥",    "巷",      
    "胡同",  "号",    "楼",    "层",    "单元" 
};

const uint32_t DIRECT_FEAT_WORD_COUNT = 4;
const char * DIRECT_FEAT_WORD[ ] = {
    "东", "西", "南", "北" //remove 中
};

/*
 *@desc:province feature word
 */ 
const uint32_t PROVINCE_FEAT_WORD_COUNT = 2;
const char *PROVINCE_FEAT_WORD[ ] = {
    "省","市"
};
const char PROVINCE_FEAT_WORD_SHENG[] = "省";
const char PROVINCE_FEAT_WORD_SHI[] = "市";

/**
 * @desc:city feature word
 */
const uint32_t CITY_FEAT_WORD_COUNT = 1;
const char *CITY_FEAT_WORD[ ] = {
    "市"
};
const char CITY_FEAT_WORD_SHI[] = "市";

/**
 * @desc: county feature word
 */
const uint32_t COUNTY_FEAT_WORD_COUNT = 3;
const char *COUNTY_FEAT_WORD[ ] = {
    "市",    "县",    "区"
};
const char COUNTY_FEAT_WORD_SHI[] = "市";
const char COUNTY_FEAT_WORD_XIAN[] = "县";
const char COUNTY_FEAT_WORD_QU[] = "区";

/**
 * @desc:town feature word
 */
const uint32_t TOWN_FEAT_WORD_COUNT  = 2;
const char *TOWN_FEAT_WORD[ ] ={
    "镇",    "乡"
};

/**
 * @desc:street feature word
 */
const uint32_t STREET_FEAT_WORD_COUNT = 9;
const char *STREET_FEAT_WORD[ ] = 
{
    "村",    "庄",    "路",    "大街",    "街",
    "大道",  "街道",  "道",    "胡同"
};
const uint32_t STREET_FEAT_WORD_GBLEN[] = 
{
    1, 1, 1, 2, 1, 
    2, 2, 1, 2
};

const uint32_t STREETNO_PREFIX_COUNT = 8;
const char * STREETNO_PREFIX[] = 
{
    "临时", "临",  "特",  "附",  "甲",
    "乙",     "丙",    "丁", 
};

/**
 * @desc:street no feature word
 */
const char STREETNO_FEAT_WORD[] = "号";

/**
@desc:addr suffix 
*/
const uint32_t ADDR_SUFFIX_COUNT = 32;
const char *ADDR_SUFFIX[ ] = {
    "州",    "乡",    "镇",    "村",    "庄",
    "路",    "街",    "楼",    "号",    "口",
    "楼",    "桥",    "巷",    "层",    "单元",
    "村庄",    "胡同",    "街道",    "旁",    "内",
    "外",    "侧",    "前",    "后",    "左",
    "右",    "东",    "南",    "西",    "北",
    "对面",    "附近"
};


const char CMP_SUFFIX_POSTAG[ ] = "cmp";

/**
 * @desc company suffix hanzi
 * ＠desc
 */
const uint32_t CMP_SUFFIX_HANZI_COUNT = 2;
const char *CMP_SUFFIX_HANZI[ ] = {
    "厂","店"
};

/**
*desc:company suffix word
*/
const uint32_t CMP_SUFFIX_WORD_COUNT = 1899; 
const char *CMP_SUFFIX_WORD[ ] = {
    "110",    "mp3",    "mp4",    "119",    "cd",
    "omega",    "puma",    "kappa",    "spa",    "pizza",
    "picc",    "kfc",    "wc",    "cd",    "dvd",
    "office",    "coffee",    "sprcoffee",    "lee",    "cafe",
    "nike",    "gre",    "swatch",    "bossini",    "taxi",
    "卡拉ok",    "chanel",    "atm",    "adidas",    "jackjones",
    "ems",    "ups",    "outlets",    "esprit",    "cpu",
    "ktv",    "only",    "playboy",    "全聚徳",    "保安",
    "图案",    "餐吧",    "茶吧",    "唱吧",    "翅吧",
    "串吧",    "迪吧",    "咖啡吧",    "剪吧",    "酒吧",
    "烤吧",    "面吧",    "酸奶吧",    "泡吧",    "水吧",
    "网吧",    "食艺吧",    "演艺吧",    "饮吧",    "唰吧",
    "涮吧",    "中巴",    "浴霸",    "美白",    "美白",
    "租摆",    "祛斑",    "幼儿班",    "地板",    "地板",
    "帆板",    "主板",    "跷跷板",    "出版",    "街道办",
    "信访办",    "小笼包",    "面包",    "女包",    "汤包",
    "外包",    "担保",    "环保",    "人保",    "珠宝",
    "举报",    "晚报",    "学报",    "早报",    "燕翅鲍",
    "设备",    "装备",    "装备",    "笔记本",    "水泵",
    "史奴比",    "礼品笔",    "日本表",    "电表",    "气表",
    "瑞士表",    "手表",    "水表",    "机械表",    "高压表",
    "仪表",    "石英表",    "钟表",    "电子表",    "滑冰",
    "溜冰",    "攀冰",    "薄饼",    "春饼",    "糕饼",
    "灌饼",    "煎饼",    "卷饼",    "烤饼",    "肉饼",
    "烧饼",    "西饼",    "镶饼",    "掉渣饼",    "手抓饼",
    "小儿病",    "皮肤病",    "骨病",    "疾病",    "疾病",
    "常见病",    "疑难病",    "风湿病",    "传播",    "鸭脖",
    "湖泊",    "发布",    "棉布",    "纺织布",    "桌布",
    "徒步",    "公安部",    "批发部",    "司法部",    "文化部",
    "指挥部",    "俱乐部",    "小卖部",    "食品部",    "建设部",
    "卫生部",    "人事部",    "门市部",    "销售部",    "交通部",
    "服务部",    "照相部",    "购销部",    "经销部",    "农业部",
    "营业部",    "贸易部",    "经营部",    "旅游部",    "门诊部",
    "政治部",    "剪裁",    "钢材",    "耗材",    "建材",
    "建材",    "器材",    "器材",    "石材",    "理财",
    "福彩",    "东北菜",    "湖北菜",    "日本菜",    "宁波菜",
    "家常菜",    "川菜",    "乡村菜",    "胶东菜",    "印度菜",
    "鄂菜",    "私房菜",    "官府菜",    "孔府菜",    "干菜",
    "赣菜",    "蒙古菜",    "公馆菜",    "云贵菜",    "法国菜",
    "韩国菜",    "泰国菜",    "中国菜",    "上海菜",    "沪菜",
    "沿淮菜",    "徽菜",    "傣家菜",    "客家菜",    "毛家菜",
    "农家菜",    "私家菜",    "土家菜",    "福建菜",    "东江菜",
    "龙江菜",    "沿江菜",    "新疆菜",    "北京菜",    "意大利菜",
    "鲁菜",    "闽菜",    "湖南菜",    "济南菜",    "皖南菜",
    "越南菜",    "云南菜",    "泡菜",    "重庆菜",    "特色菜",
    "苏菜",    "民俗菜",    "素菜",    "风味菜",    "江西菜",
    "陕西菜",    "湘菜",    "家乡菜",    "韩国小菜",    "绍兴菜",
    "东南亚菜",    "淮扬菜",    "粤菜",    "斋菜",    "浙菜",
    "潮州菜",    "广州菜",    "贵州菜",    "杭州菜",    "苏州菜",
    "扬州菜",    "杀猪菜",    "炖菜",    "茶餐",    "快餐",
    "冷餐",    "送餐",    "西餐",    "用餐",    "早餐",
    "中餐",    "自助餐",    "冷藏",    "收藏",    "搏击操",
    "健美操",    "烟草",    "公厕",    "注册",    "监测",
    "检测",    "奶茶",    "茗茶",    "茗茶",    "检查",
    "考察",    "地产",    "房地产",    "不动产",    "房产",
    "特产",    "资产",    "工业搬场",    "溜冰场",    "操场",
    "检测场",    "停车场",    "运动场",    "广场",    "搏击场",
    "鸡场",    "剧场",    "游乐场",    "林场",    "卖场",
    "煤场",    "畜牧场",    "牛奶场",    "牛场",    "农场",
    "家禽场",    "棒球场",    "高尔夫球场",    "篮球场",    "网球场",
    "足球场",    "商场",    "砂石场",    "沙石场",    "市场",
    "练习场",    "滑雪场",    "渔场",    "体育场",    "浴场",
    "海滨浴场",    "养殖场",    "猪场",    "种子场",    "灌肠",
    "小肠",    "鸭肠",    "橡胶厂",    "修理厂",    "印刷厂",
    "汽修厂",    "小炒",    "金杯车",    "冷藏车",    "工程车",
    "高档车",    "电车",    "电动车",    "机动车",    "火车",
    "货车",    "轿车",    "卡车",    "客车",    "助力车",
    "汽车",    "汽车",    "二手车",    "运输车",    "配送车",
    "停车",    "摩托车",    "保温车",    "商务车",    "洗车",
    "自行车",    "修车",    "越野车",    "婚庆用车",    "电源车",
    "转运车",    "租车",    "出租车",    "建材城",    "茶城",
    "练歌城",    "松骨城",    "鸡架城",    "权金城",    "啤酒城",
    "康乐城",    "游乐城",    "娱乐城",    "电脑城",    "金山城",
    "商城",    "美食城",    "二手城",    "鞋城",    "不夜城",
    "游艺城",    "交易城",    "影城",    "旅游城",    "浴城",
    "电子城",    "工程",    "轴承",    "名吃",    "小吃",
    "钥匙",    "游泳池",    "浴池",    "鲍翅",    "鸡翅",
    "烤翅",    "鱼翅",    "丝绸",    "劳务输出",    "演出",
    "小厨",    "仓储",    "存储",    "存车处",    "信访处",
    "分理处",    "售楼处",    "售票处",    "办事处",    "销售处",
    "经销处",    "经营处",    "公证处",    "帆船",    "烤串",
    "肉串",    "红斑狼疮",    "门窗",    "水上蹦床",    "沙发床",
    "烤瓷",    "陶瓷",    "度假村",    "啤酒村",    "渔村",
    "仓库储存",    "野外生存",    "疙瘩",    "散打",    "音乐卡带",
    "宽带",    "录影带",    "皮尔卡丹",    "禽蛋",    "典当",
    "共产党",    "排档",    "舞蹈",    "指导",    "轨道",
    "剑道",    "截拳道",    "跆拳道",    "柔道",    "空手道",
    "足道",    "全聚德",    "霓虹灯",    "甲等",    "甲等",
    "甲等",    "乙等",    "乙等",    "乙等",    "基地",
    "置地",    "快递",    "速递",    "专递",    "景点",
    "奶酪点",    "西点",    "早点",    "庆典",    "床垫",
    "靠垫",    "座垫",    "广电",    "黑电",    "小家电",
    "五金交电",    "强电",    "弱电",    "4s店",    "珠宝店",
    "表店",    "钟表店",    "建材店",    "菜店",    "烤翅店",
    "陶瓷店",    "影碟店",    "饭店",    "咖啡店",    "水果店",
    "花店",    "什货店",    "杂货店",    "烤鸡店",    "眼镜店",
    "酒店",    "酒店",    "玩具店",    "灶具店",    "烧烤店",
    "涮烤店",    "折扣店",    "彩扩店",    "便利店",    "粮店",
    "旅店",    "专卖店",    "鞋帽店",    "面店",    "便民店",
    "品牌名店",    "果品店",    "精品店",    "乳品店",    "食品店",
    "用品店",    "化妆品店",    "乐器店",    "玉器店",    "洗染店",
    "缝纫店",    "烤肉店",    "商店",    "串烧店",    "甜食店",
    "手饰店",    "书店",    "水店",    "全素店",    "连锁店",
    "洗烫店",    "美味店",    "宠物店",    "音像店",    "小店",
    "鞋店",    "鸭店",    "烤鸭店",    "药店",    "药店",
    "茶叶店",    "洗衣店",    "洗衣店",    "影音店",    "复印店",
    "粮油店",    "洗浴店",    "钟店",    "卤煮店",    "时装店",
    "药妆店",    "空调",    "鉴定",    "预订",    "装订",
    "古董",    "活动",    "移动",    "运动",    "运动",
    "探洞",    "祛痘",    "浴都",    "监督",    "戒毒",
    "排毒",    "爆肚",    "牛肚",    "涮肚",    "稽查队",
    "打井队",    "运输队",    "交通队",    "建筑队",    "士多",
    "清汤鹅",    "荪鹅",    "萨拉伯尔",    "鱼饵",    "补发",
    "假发",    "剪发",    "开发",    "理发",    "美发",
    "批发",    "染发",    "沙发",    "防脱生发",    "烫发",
    "秀发",    "织发",    "植发",    "盒饭",    "煲饭",
    "茶坊",    "陶瓷坊",    "工坊",    "花坊",    "酒坊",
    "烘培坊",    "肉坊",    "食坊",    "舞坊",    "宠物坊",
    "鞋坊",    "鸭坊",    "衣坊",    "练歌房",    "涮烤房",
    "膳房",    "二手房",    "套房",    "药房",    "租房",
    "家纺",    "咖啡",    "减肥",    "酸辣粉",    "米粉",
    "护肤",    "护肤",    "美肤",    "加氟",    "礼服",
    "羽绒服",    "西服",    "周大福",    "家乐福",    "托福",
    "菜府",    "膳府",    "食神府",    "食府",    "政府",
    "公主府",    "豆腐",    "臭豆腐",    "恢复",    "康复",
    "鱼竿",    "彩钢",    "塑钢",    "不锈钢",    "职高",
    "蛋糕",    "蛋糕",    "年糕",    "枣糕",    "甑糕",
    "乳鸽",    "酒阁",    "食阁",    "化工",    "技工",
    "加工",    "施工",    "小时工",    "特供",    "文化宫",
    "娱乐宫",    "青年宫",    "少年宫",    "中共",    "机构",
    "评估",    "欢乐谷",    "峡谷",    "控股",    "照顾",
    "壁挂",    "机关",    "道观",    "景观",    "奇观",
    "城管",    "档案馆",    "宾馆",    "菜馆",    "餐馆",
    "茶馆",    "场馆",    "运动馆",    "饭馆",    "咖啡馆",
    "画馆",    "会馆",    "生活馆",    "科技馆",    "酒馆",
    "香辣馆",    "展览馆",    "粗粮馆",    "陈列馆",    "旅馆",
    "面馆",    "纪念馆",    "保龄球馆",    "乒乓球馆",    "网球馆",
    "肉馆",    "烩食馆",    "大使馆",    "图书馆",    "美术馆",
    "艺术馆",    "风味馆",    "天文馆",    "博物馆",    "照相馆",
    "照像馆",    "小馆",    "蟹馆",    "海洋馆",    "游泳馆",
    "鱼馆",    "体育馆",    "水族馆",    "瑜珈馆",    "灯光",
    "激光",    "验光",    "推广",    "机柜",    "文件柜",
    "钱柜",    "保险柜",    "专柜",    "干锅",    "火锅",
    "香辣锅",    "一品锅",    "砂锅",    "沙锅",    "汤锅",
    "牛尾锅",    "麻辣香锅",    "老城一锅",    "炖鱼锅",    "涮锅",
    "焖锅",    "水果",    "接送小孩",    "结核",    "永和",
    "疤痕",    "割痕",    "保护",    "陪护",    "维护",
    "养护",    "订花",    "豆花",    "易初莲花",    "盛世莲花",
    "盆花",    "送花",    "鲜花",    "用花",    "仿真花",
    "轮滑",    "绘画",    "书画",    "油画",    "策划",
    "策划",    "计划",    "企划",    "自动化",    "净化",
    "绿化",    "生化",    "电话",    "开荒",    "黄记煌",
    "花卉",    "大会",    "工会",    "联合会",    "基金会",
    "村委会",    "家委会",    "居委会",    "协会",    "联谊会",
    "车友会",    "委员会",    "红十字会",    "夜总会",    "彩绘",
    "测绘",    "喷绘",    "体绘",    "麻辣诱惑",    "百货",
    "旧货",    "期货",    "山货",    "拳击",    "肯德基",
    "中大恒基",    "碟机",    "交换机",    "打火机",    "礼品火机",
    "取款机",    "台式机",    "手机",    "饮水机",    "计算机",
    "游戏机",    "摄相机",    "照相机",    "摄像机",    "抽油烟机",
    "口腔正畸",    "名胜古迹",    "焗鸡",    "扒鸡",    "棒棒鸡",
    "土钵鸡",    "柴鸡",    "烤鸡",    "大盘鸡",    "烧鸡",
    "百岁鸡",    "土鸡",    "香鸡",    "熏鸡",    "炸鸡",
    "辣子鸡",    "高科技",    "会计",    "设计",    "统计",
    "张生记",    "经纪",    "搬家",    "管家",    "酒家",
    "人家",    "食家",    "我爱我家",    "吉野家",    "老年之家",
    "少年之家",    "美甲",    "美甲",    "美甲",    "单人间",
    "多人间",    "双人间",    "标准间",    "体检",    "名剪",
    "附件",    "零件",    "配件",    "软件",    "保健",
    "击剑",    "豆浆",    "瀑降",    "速降",    "悬降",
    "泡椒",    "公交",    "梦特娇",    "修脚",    "水饺",
    "基督教",    "家教",    "美教",    "天主教",    "保洁",
    "车世界",    "海底世界",    "家世界",    "婚介",    "婚介",
    "中介",    "毛巾",    "五金",    "五金",    "水晶",
    "盆景",    "鸭颈",    "散光镜",    "老花镜",    "配镜",
    "近视镜",    "远视镜",    "眼镜",    "太阳镜",    "名酒",
    "酿酒",    "烟酒",    "急救",    "故居",    "家居",
    "好邻居",    "公安局",    "档案局",    "干部局",    "监察局",
    "水产局",    "供电局",    "邮电局",    "监督局",    "司法局",
    "消防局",    "信访局",    "分局",    "规划局",    "农机局",
    "审计局",    "统计局",    "物价局",    "水利局",    "园林局",
    "公路局",    "联络局",    "保密局",    "移民局",    "畜牧局",
    "工商局",    "招商局",    "卫生局",    "粮食局",    "人事局",
    "外事局",    "国税局",    "交通局",    "环卫局",    "服务局",
    "商务局",    "事务局",    "水务局",    "税务局",    "气象局",
    "检验局",    "海洋局",    "林业局",    "农业局",    "商业局",
    "邮局",    "资源局",    "保障局",    "财政局",    "民政局",
    "邮政局",    "厨具",    "刀具",    "灯具",    "钓具",
    "工具",    "家具",    "洁具",    "模具",    "皮具",
    "玩具",    "网具",    "文具",    "用具",    "渔具",
    "连续剧",    "网卡",    "信用卡",    "健康",    "自考",
    "烧烤",    "本科",    "齿科",    "牙科",    "星巴克",
    "耐克",    "雕刻",    "快客",    "必胜客",    "航空",
    "穿孔",    "打孔",    "自控",    "进出口",    "折扣",
    "储存库",    "西裤",    "休闲裤",    "贷款",    "彩扩",
    "冲扩",    "打蜡",    "麻辣",    "好利来",    "花篮",
    "拉篮",    "展览",    "电缆",    "七匹狼",    "发廊",
    "画廊",    "酒廊",    "新郎",    "冲浪",    "豆捞",
    "水果捞",    "麦当劳",    "农家乐",    "娱乐",    "芭蕾",
    "球类",    "制冷",    "狗不理",    "处理",    "代理",
    "管理",    "护理",    "料理",    "心理",    "修理",
    "福利",    "专利",    "电力",    "巧克力",    "玻璃",
    "妇联",    "华联",    "美宝莲",    "蜂巢帘",    "窗帘",
    "垂帘",    "卷帘",    "天篷帘",    "风琴帘",    "扇型帘",
    "浴帘",    "竹帘",    "陪练",    "训练",    "粗粮",
    "测量",    "水疗",    "诊疗",    "治疗",    "足疗",
    "材料",    "电料",    "涂料",    "园林",    "冰激淋",
    "冰淇淋",    "租赁",    "冰激凌",    "冰淇凌",    "河流",
    "交流",    "漂流",    "物流",    "京客隆",    "天客隆",
    "茶楼",    "大楼",    "咖啡楼",    "川府楼",    "酒楼",
    "洒楼",    "食楼",    "美味楼",    "商务楼",    "影楼",
    "写字楼",    "糖葫芦",    "微波炉",    "电磁炉",    "锅炉",
    "班尼路",    "法律",    "沃尔玛",    "数码",    "骑马",
    "烧麦",    "买卖",    "拍卖",    "外卖",    "专卖",
    "鞋帽",    "遮阳帽",    "工贸",    "技贸",    "科贸",
    "商贸",    "洗眉",    "传媒",    "味多美",    "国美",
    "美廉美",    "物美",    "防盗门",    "分娩",    "面爱面",
    "拌面",    "扯面",    "烩面",    "炸酱面",    "拉面",
    "冷面",    "牛肉面",    "汤面",    "云吞面",    "削面",
    "刀削面",    "莜面",    "手擀面",    "种苗",    "扫描",
    "寺庙",    "移民",    "照明",    "村名",    "起名",
    "取名",    "按摩",    "保姆",    "公墓",    "烈士墓",
    "平衡木",    "桑拿",    "推拿",    "推拿",    "俏江南",
    "电脑",    "豆腐脑",    "节能",    "太阳能",    "水泥",
    "新娘",    "九头鸟",    "李宁",    "苏宁",    "肥牛",
    "佐丹奴",    "华伦天奴",    "供暖",    "水暖",    "牛排",
    "品牌",    "u盘",    "方向盘",    "硬盘",    "肥胖",
    "婚配",    "汽配",    "修配",    "影棚",    "彩票",
    "查票",    "火车票",    "汽车票",    "演出票",    "船票",
    "订票",    "优惠票",    "机票",    "展览票",    "门票",
    "二手票",    "送票",    "送票",    "电影票",    "邮票",
    "体育票",    "打折票",    "产品",    "护肤品",    "干鲜果品",
    "保健品",    "精品",    "礼品",    "食品",    "饰品",
    "甜品",    "药品",    "工艺品",    "用品",    "制品",
    "化妆品",    "招聘",    "邓亚萍",    "渔公渔婆",    "当铺",
    "花圃",    "苗圃",    "减肥食谱",    "油漆",    "防火油漆",
    "施华洛世奇",    "瓷器",    "电器",    "乐器",    "过滤器",
    "散热器",    "健身器",    "显示器",    "净水器",    "家用净水器",
    "热水器",    "助听器",    "服务器",    "混响器",    "步行器",
    "仪器",    "仪器",    "玉器",    "电气",    "液化气",
    "燃气",    "派遣",    "口腔",    "外墙",    "立交桥",
    "电子琴",    "婚庆",    "沙狐球",    "篮球",    "羽毛球",
    "排球",    "乒乓球",    "热气球",    "健身球",    "台球",
    "足球",    "开发区",    "景区",    "风景区",    "游乐区",
    "小区",    "光驱",    "太极拳",    "证券",    "烫染",
    "转让",    "老人",    "理容",    "美容",    "整容",
    "狗肉",    "酱肉",    "烤肉",    "驴肉",    "牛肉",
    "鲜肉",    "熏肉",    "羊肉",    "涮肉",    "焖肉",
    "美乳",    "接入",    "被褥",    "比萨",    "遮阳伞",
    "月嫂",    "浩沙",    "婚纱",    "防晒",    "登山",
    "衬衫",    "羊绒衫",    "慈善",    "电扇",    "风扇",
    "换气扇",    "开发商",    "农工商",    "经销商",    "鉴赏",
    "铁板烧",    "火烧",    "介绍",    "茶舍",    "旅舍",
    "出版社",    "报社",    "茶社",    "会社",    "旅社",
    "图片社",    "商社",    "书社",    "艺术社",    "供销社",
    "旅行社",    "信用社",    "合作社",    "制作社",    "健身",
    "纹身",    "周大生",    "养生",    "家庭厨师",    "律师",
    "税务师",    "溜石",    "钻石",    "辅食",    "副食",
    "美食",    "面食",    "肉食",    "熟食",    "素食",
    "饮食",    "知识",    "驾驶",    "展示",    "巴士",
    "乐杰士",    "丧事",    "屈臣仕",    "灯饰",    "灯饰",
    "服饰",    "家饰",    "首饰",    "银饰",    "玉饰",
    "装饰",    "钻饰",    "屈臣氏",    "超市",    "茶室",
    "办公室",    "画室",    "棋牌室",    "卫生室",    "游艺室",
    "工作室",    "电视",    "影视",    "体能测试",    "回收",
    "函授",    "发售",    "零售",    "销售",    "租售",
    "运输",    "图书",    "金属",    "技术",    "美术",
    "武术",    "花束",    "粉刷",    "印刷",    "李小双",
    "防水",    "供水",    "滑水",    "纯净水",    "潜水",
    "矿泉水",    "送水",    "跳水",    "桶装水",    "报税",
    "东来顺",    "阿迪达斯",    "哈根达斯",    "真维斯",    "雅思",
    "家私",    "公司",    "寿司",    "配送",    "住宿",
    "杂碎",    "汽车锁",    "换锁",    "开锁",    "连锁",
    "密码锁",    "修锁",    "社保所",    "公共厕所",    "场所",
    "派出所",    "招待所",    "邮电所",    "托儿所",    "房管所",
    "监管所",    "设计所",    "研究所",    "托老所",    "监理所",
    "工商所",    "介绍所",    "技术所",    "服务所",    "事务所",
    "税务所",    "储蓄所",    "交易所",    "诊所",    "邮政所",
    "轮胎",    "电台",    "寻呼台",    "电视台",    "面瘫",
    "小儿脑瘫",    "地毯",    "煤炭",    "牛骨汤",    "鸡汤",
    "鸭汤",    "羊汤",    "煨汤",    "靓汤",    "避风塘",
    "饭堂",    "教堂",    "音乐堂",    "礼堂",    "食堂",
    "麻辣烫",    "染烫",    "椅套",    "座套",    "电梯",
    "扶梯",    "滑梯",    "普拉提",    "康体",    "纤体",
    "形体",    "锅贴",    "城铁",    "地铁",    "中铁",
    "餐厅",    "茶餐厅",    "西餐厅",    "迪厅",    "饭厅",
    "咖啡厅",    "歌厅",    "音乐厅",    "娱乐厅",    "乐器厅",
    "舞厅",    "歌舞厅",    "游戏厅",    "录像厅",    "游艺厅",
    "报亭",    "报刊亭",    "皮划艇",    "赛艇",    "交通",
    "联通",    "融通",    "疏通",    "铁通",    "网通",
    "卫通",    "迪信通",    "系统",    "骨头",    "猎头",
    "滨角码头",    "馒头",    "兔头",    "鸭头",    "羊头",
    "鱼头",    "枕头",    "造图",    "集团",    "剧团",
    "乐团",    "艺术团",    "全托",    "日托",    "半日托",
    "临时托",    "电玩",    "古玩",    "濑尿牛丸",    "肉丸",
    "金百万",    "九牧王",    "旅游网",    "鱼网",    "美特斯邦威",
    "匡威",    "纤维",    "计生委",    "团委",    "风味",
    "京味",    "美味",    "妊娠纹",    "顾问",    "烘焙屋",
    "饼屋",    "菜屋",    "茶屋",    "发屋",    "房屋",
    "咖啡屋",    "酒屋",    "精品屋",    "食品屋",    "甜品屋",
    "食屋",    "书屋",    "鞋屋",    "拉丁舞",    "歌舞",
    "街舞",    "购物",    "服务",    "家务",    "劳务",
    "票务",    "商务",    "事务",    "水务",    "业务",
    "印务",    "分析",    "信息",    "溯溪",    "冲洗",
    "干洗",    "清洗",    "水洗",    "游戏",    "香爆虾",
    "龙虾",    "大厦",    "商厦",    "海鲜",    "休闲",
    "保险",    "财险",    "车险",    "寿险",    "布线",
    "洗唇线",    "米线",    "网线",    "鱼线",    "照相",
    "电冰箱",    "保管箱",    "集装箱",    "水族箱",    "鱼乡",
    "滑翔",    "金凤成祥",    "音响",    "摄像",    "音像",
    "影像",    "经销",    "批销",    "营销",    "直销",
    "党校",    "技校",    "驾校",    "网校",    "学校",
    "夜校",    "职校",    "溜冰鞋",    "擦鞋",    "运动鞋",
    "增高鞋",    "男鞋",    "慢跑鞋",    "皮鞋",    "球鞋",
    "童鞋",    "拖鞋",    "休闲鞋",    "修鞋",    "消协",
    "机械",    "器械",    "器械",    "香辣蟹",    "换锁芯",
    "技术创新",    "翻新",    "中心",    "电信",    "通信",
    "发型",    "造型",    "整形",    "茶行",    "车行",
    "发行",    "分行",    "工行",    "建行",    "交行",
    "茶具行",    "农行",    "乐器行",    "玉器行",    "琴行",
    "商行",    "农商行",    "鞋行",    "银行",    "招行",
    "支行",    "中行",    "总行",    "丰胸",    "隆胸",
    "急修",    "汽修",    "维修",    "维修",    "装修",
    "茶轩",    "大学",    "化学",    "留学",    "小学",
    "中学",    "滑雪",    "查询",    "咨询",    "培训",
    "电讯",    "通讯",    "资讯",    "资讯",    "减压",
    "口袋鸭",    "啤酒鸭",    "烤鸭",    "老鸭",    "烧鸭",
    "卤水鸭",    "烤香鸭",    "家乡鸭",    "种植牙",    "烟",
    "香烟",    "攀岩",    "美颜",    "小肥羊",    "烤全羊",
    "保养",    "敬养",    "培养",    "兽药",    "西药",
    "医药",    "制药",    "中药",    "越野",    "出版业",
    "茶业",    "产业",    "工业",    "铝业",    "企业",
    "实业",    "物业",    "鞋业",    "药业",    "纸业",
    "置业",    "牙医",    "内衣",    "寿衣",    "睡衣",
    "洗衣",    "制衣",    "礼仪",    "殡仪",    "布艺",
    "茶艺",    "发艺",    "工艺",    "剪艺",    "游艺",
    "园艺",    "交易",    "贸易",    "免疫",    "翻译",
    "餐饮",    "冷饮",    "打印",    "复印",    "快印",
    "速印",    "九头鹰",    "供应",    "经营",    "露营",
    "专营",    "摄影",    "游泳",    "应用",    "全特优",
    "路由",    "柴油",    "润滑油",    "机油",    "汽油",
    "导游",    "旅游",    "鲍鱼",    "梭边鱼",    "酸菜鱼",
    "冷锅鱼",    "呛锅鱼",    "石锅鱼",    "香锅鱼",    "炝锅鱼",
    "甲鱼",    "烤鱼",    "烤全鱼",    "锅台鱼",    "酸汤鱼",
    "水煮鱼",    "英语",    "不孕不育",    "教育",    "体育",
    "卫浴",    "洗浴",    "足浴",    "沐浴",    "公寓",
    "救援",    "茶园",    "垂钓园",    "幼儿园",    "公园",
    "大观园",    "啤酒花园",    "饺园",    "乐园",    "游乐园",
    "陵园",    "墓园",    "动物园",    "植物园",    "婴幼园",
    "幼稚园",    "民族园",    "电源",    "能源",    "人力资源",
    "茶苑",    "咖啡苑",    "食苑",    "精神病院",    "茶院",
    "检查院",    "检察院",    "法院",    "画院",    "设计院",
    "农家院",    "研究院",    "剧院",    "影剧院",    "敬老院",
    "养老院",    "福利院",    "美疗院",    "美容院",    "卫生院",
    "戏院",    "学院",    "疗养院",    "医院",    "中医院",
    "影院",    "电影院",    "保育院",    "防治院",    "搬运",
    "储运",    "货运",    "客运",    "空运",    "快运",
    "托运",    "殡葬",    "制造",    "煤渣",    "发展",
    "拓展",    "野战",    "搅拌站",    "广播站",    "检测站",
    "汽车站",    "收费站",    "轻轨站",    "农机站",    "急救站",
    "畜牧站",    "卫生站",    "水站",    "地铁站",    "服务站",
    "维修站",    "检验站",    "林业站",    "兽医站",    "防疫站",
    "供应站",    "加油站",    "客运站",    "工作站",    "印章",
    "快照",    "拍照",    "婚纱照",    "被罩",    "清真",
    "写真",    "门诊",    "矫正",    "家政",    "邮政",
    "签证",    "抽脂",    "豆汁",    "组织",    "绿植",
    "种植",    "养殖",    "照相纸",    "杂志",    "布置",
    "订制",    "控制",    "附中",    "高中",    "卤煮",
    "互助",    "建筑",    "大专",    "中专",    "壁砖",
    "磁砖",    "瓷砖",    "抛光砖",    "釉面砖",    "茶庄",
    "饭庄",    "棒骨庄",    "豆花庄",    "酒庄",    "山庄",
    "鱼庄",    "安装",    "包装",    "服装",    "孕妇装",
    "工装",    "家装",    "男装",    "女装",    "童装",
    "靓装",    "化妆",    "麻将桌",    "投资",    "物资",
    "烧鹅仔",    "牛仔",    "煲仔",    "包子",    "花花公子",
    "饺子",    "羊蝎子",    "羊羯子",    "打字",    "刻字",
    "出租",    "招租",    "沐足",    "联合组",    "合作",
    "制作",    "一茶一坐",    "瑜伽",    "泡芙",    "馄饨",
    "肉夹馍",    "烤涮",    "装潢",    "瑜珈",    "电饭煲",
    "鸡公煲",    "鸡煲",    "保镖",    "虹鳟"
};

/**
 * @desc: addr index word
 */
const uint32_t ADDR_INDEX_WORD_COUNT = 4;
const char *ADDR_INDEX_WORD[ ] = {
    "在"    ,    "到",    "去",    "往"
};

/**
*@desc:addr prefix word
*/
const uint32_t ADDR_PREFIX_COUNT = 3;
const char *ADDR_PREFIX[] = {
    "地址","位于","座落"
};


/**
*@desc:addr prefix flag
*/
const uint32_t ADDR_PREFIX_FLAG_COUNT = 6;
const char *ADDR_PREFIX_FLAG[] = {
    ":",    "：",    "是",    "为",    "在",
    "于"
};

/**
 * @desc: addr separator 
 */
const uint32_t ADDR_SEPARATOR_COUNT = 55;
const char * ADDR_SEPARATOR[ ] = {
    " ",    "－",    "-",    "！",    "!",
    
    "\"",    "%",    "％",    ",",    "，",    
    
    "、",    "．",    ".",    "。",    ":",
    
    "：",    ";",    "；",    "?",    "？",
    
    "[",    "［",    "］",    "]",    "~",
    
    "～",    "‘",    "’",    "“",    "”",
    
    "《",    "》",    "【",    "】",    "<",
    
    "＜",    ">",    "＞",    "·",    "·",
    
    "…",    "……",    "℃",    "\\",    "+",
    
    "-",    "*",    "/",    "{",    "}",
    
    "@",    "#",    "$",    "￥",    "&"
};

/**
 * @desc: addr rule weight
 */
    //addr string includes feature word
const char ADDR_RULE_FEATWORD[ ] = "featword";
const char ADDR_RULE_FEATWORD_WEIGHT[] = "5";

    //addr string includes suffix word
const char ADDR_RULE_SUFFIXWORD[ ] = "suffixword";
const char ADDR_RULE_SUFFIXWORD_WEIGHT[ ] = "10";

    //addr string includes arabic numerals
const char ADDR_RULE_ABA[ ] = "abr";
const char ADDR_RULE_ABA_WEIGHT[ ] = "5";

    //addr string includes province(by segment)
const char ADDR_RULE_PROVINCE[ ] = "province";//ns-1
const char ADDR_RULE_PROVINCE_WEIGHT[ ] = "5";

    //addr string includes city(by segment)
const char ADDR_RULE_CITY[ ] = "city";//ns-2
const char ADDR_RULE_CITY_WEIGHT[ ] = "5";

    //addr string includes county(by segment)
const char ADDR_RULE_COUNTY[ ] = "county";//ns-3
const char ADDR_RULE_COUNTY_WEIGHT[ ] = "5";

    //addr string includes town    
const char ADDR_RULE_TOWN[ ] = "town";
const char ADDR_RULE_TOWN_WEIGHT[ ] = "10";

    //addr string includes street
const char ADDR_RULE_STREET[ ] = "street";
const char ADDR_RULE_STREET_WEIGHT[ ] = "30";

    //addr string includes street no
const char ADDR_RULE_STREETNO[ ] = "streetno";
const char ADDR_RULE_STREETNO_WEIGHT[ ] = "40";    

//negative rule:
    //addr string end with cmp suffix
const char ADDR_RULE_CMPSUFFIX[ ] = "cmpsuffix";
const char ADDR_RULE_CMPSUFFIX_WEIGHT[ ] = "-50";

